<?php
// Heading
$_['heading_title']                = 'Playful Sparkle - Χάρτης ιστοτόπου Google';
$_['heading_robotstxt']            = 'Robots.txt';
$_['heading_product']              = 'Προϊόντα';
$_['heading_category']             = 'Κατηγορίες';
$_['heading_manufacturer']         = 'Κατασκευαστές';
$_['heading_information']          = 'Πληροφορίες';
$_['heading_getting_started']      = 'Ξεκινώντας';
$_['heading_setup']                = 'Ρύθμιση Χάρτη ιστοτόπου Google';
$_['heading_troubleshot']          = 'Συνηθισμένη Αντιμετώπιση Προβλημάτων';
$_['heading_faq']                  = 'Συχνές Ερωτήσεις';
$_['heading_contact']              = 'Επικοινωνία με την Υποστήριξη';

// Text
$_['text_extension']               = 'Επεκτάσεις';
$_['text_success']                 = 'Επιτυχία: Τροποποιήσατε την ροή του Χάρτη ιστοτόπου Google!';
$_['text_htaccess_update_success'] = 'Επιτυχία: Το αρχείο .htaccess ενημερώθηκε με επιτυχία.';
$_['text_edit']                    = 'Επεξεργασία Χάρτη ιστοτόπου Google';
$_['text_clear']                   = 'Εκκαθάριση Βάσης Δεδομένων';
$_['text_getting_started']         = '<p><strong>Επισκόπηση:</strong> Ο Χάρτης ιστοτόπου Google για OpenCart 3.x βοηθά στην ενίσχυση της ορατότητας του καταστήματός σας δημιουργώντας βελτιστοποιημένους χάρτες ιστοτόπου XML. Αυτοί οι χάρτες ιστοτόπου βοηθούν τις μηχανές αναζήτησης όπως η Google να ευρετηριάσουν τις βασικές σελίδες του ιστότοπού σας, οδηγώντας σε καλύτερες κατατάξεις στις μηχανές αναζήτησης και αυξημένη διαδικτυακή παρουσία.</p><p><strong>Απαιτήσεις:</strong> OpenCart 3.x+, PHP 7.3 ή νεότερη και πρόσβαση στην <a href="https://search.google.com/search-console/about?hl=en" target="_blank" rel="external noopener noreferrer">Κονσόλα Αναζήτησης Google</a> για υποβολή χάρτη ιστοτόπου.</p>';
$_['text_setup']                   = '<p><strong>Ρύθμιση Χάρτη ιστοτόπου Google:</strong> Διαμορφώστε τον χάρτη ιστοτόπου σας ώστε να περιλαμβάνει σελίδες Προϊόντων, Κατηγοριών, Κατασκευαστών και Πληροφοριών ανάλογα με τις ανάγκες. Ενεργοποιήστε ή απενεργοποιήστε τις επιλογές για να ενεργοποιήσετε ή να απενεργοποιήσετε αυτούς τους τύπους σελίδων στην έξοδο του χάρτη ιστοτόπου, προσαρμόζοντας το περιεχόμενο του χάρτη ιστοτόπου στις ανάγκες και το κοινό του καταστήματός σας.</p>';
$_['text_troubleshot']             = '<ul><li><strong>Επέκταση:</strong> Βεβαιωθείτε ότι η επέκταση του Χάρτη ιστοτόπου Google είναι ενεργοποιημένη στις ρυθμίσεις του OpenCart. Εάν η επέκταση είναι απενεργοποιημένη, η έξοδος του χάρτη ιστοτόπου δεν θα δημιουργηθεί.</li><li><strong>Προϊόν:</strong> Εάν λείπουν σελίδες προϊόντων από τον χάρτη ιστοτόπου σας, βεβαιωθείτε ότι είναι ενεργοποιημένες στις ρυθμίσεις της επέκτασης και ότι τα σχετικά προϊόντα έχουν την κατάστασή τους ορισμένη σε "Ενεργοποιημένο".</li><li><strong>Κατηγορία:</strong> Εάν δεν εμφανίζονται σελίδες κατηγοριών, ελέγξτε ότι οι κατηγορίες είναι ενεργοποιημένες στις ρυθμίσεις της επέκτασης και ότι η κατάστασή τους είναι επίσης ορισμένη σε "Ενεργοποιημένο".</li><li><strong>Κατασκευαστής:</strong> Για τις σελίδες κατασκευαστών, βεβαιωθείτε ότι είναι ενεργοποιημένες στις ρυθμίσεις της επέκτασης και ότι οι κατασκευαστές έχουν την κατάστασή τους ορισμένη σε "Ενεργοποιημένο".</li><li><strong>Πληροφορίες:</strong> Εάν δεν εμφανίζονται σελίδες πληροφοριών στον χάρτη ιστοτόπου, βεβαιωθείτε ότι είναι ενεργοποιημένες στις ρυθμίσεις της επέκτασης και ότι η κατάστασή τους είναι ορισμένη σε "Ενεργοποιημένο".</li></ul>';
$_['text_faq']                     = '<details><summary>Πώς μπορώ να υποβάλω τον χάρτη ιστοτόπου μου στην Κονσόλα Αναζήτησης Google;</summary>Στην Κονσόλα Αναζήτησης Google, μεταβείτε στους <em>Χάρτες ιστοτόπου</em> στο μενού, εισαγάγετε τη διεύθυνση URL του χάρτη ιστοτόπου (συνήθως /sitemap.xml) και κάντε κλικ στην <em>Υποβολή</em>. Αυτό θα ειδοποιήσει την Google να ξεκινήσει την ανίχνευση του ιστότοπού σας.</details><details><summary>Γιατί είναι σημαντικός ένας χάρτης ιστοτόπου για το SEO;</summary>Ένας χάρτης ιστοτόπου καθοδηγεί τις μηχανές αναζήτησης στις πιο σημαντικές σελίδες του ιστότοπού σας, διευκολύνοντας την ακριβή ευρετηρίαση του περιεχομένου σας, γεγονός που μπορεί να επηρεάσει θετικά τις κατατάξεις αναζήτησης.</details><details><summary>Περιλαμβάνονται εικόνες στον χάρτη ιστοτόπου;</summary>Ναι, οι εικόνες περιλαμβάνονται στον δημιουργημένο χάρτη ιστοτόπου από αυτήν την επέκταση, διασφαλίζοντας ότι οι μηχανές αναζήτησης μπορούν να ευρετηριάσουν το οπτικό σας περιεχόμενο μαζί με τη διεύθυνση URL.</details><details><summary>Γιατί ο χάρτης ιστοτόπου χρησιμοποιεί το <em>lastmod</em> αντί για <em>priority</em> και <em>changefreq</em>;</summary>Η Google πλέον αγνοεί τις τιμές <priority> και <changefreq>, εστιάζοντας αντ\' αυτού στο <lastmod> για τη φρεσκάδα του περιεχομένου. Η χρήση του <lastmod> βοηθά στην ιεράρχηση των πρόσφατων ενημερώσεων.</details>';
$_['text_contact']                 = '<p>Για περαιτέρω βοήθεια, επικοινωνήστε με την ομάδα υποστήριξής μας:</p><ul><li><strong>Επικοινωνία:</strong> <a href="mailto:%s">%s</a></li><li><strong>Τεκμηρίωση:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Εγχειρίδιο Χρήσης</a></li></ul>';
$_['text_user_agent_any']          = 'Οποιοσδήποτε Πράκτορας Χρήστη';
$_['text_allowed']                 = 'Επιτρέπεται: %s';
$_['text_disallowed']              = 'Δεν επιτρέπεται: %s';

// Tab
$_['tab_general']                  = 'Γενικά';
$_['tab_help_and_support']         = 'Βοήθεια &amp; Υποστήριξη';
$_['tab_data_feed_url']            = 'Διεύθυνση URL Ροής Δεδομένων';
$_['tab_data_feed_seo_url']        = 'SEO-Φιλική Διεύθυνση URL Ροής Δεδομένων';

// Entry
$_['entry_status']                 = 'Κατάσταση';
$_['entry_product']                = 'Προϊόν';
$_['entry_product_images']         = 'Εξαγωγή εικόνων προϊόντων';
$_['entry_max_product_images']     = 'Μέγ. εικόνες προϊόντων';
$_['entry_category']               = 'Κατηγορία';
$_['entry_category_images']        = 'Εξαγωγή εικόνων κατηγοριών';
$_['entry_manufacturer']           = 'Κατασκευαστής';
$_['entry_manufacturer_images']    = 'Εξαγωγή εικόνας κατασκευαστή';
$_['entry_information']            = 'Πληροφορίες';
$_['entry_data_feed_url']          = 'Διεύθυνση URL Ροής Δεδομένων';
$_['entry_active_store']           = 'Ενεργό Κατάστημα';
$_['entry_htaccess_mod']           = '.htaccess Τροποποίηση';
$_['entry_validation_results']     = 'Αποτελέσματα επικύρωσης';
$_['entry_user_agent']             = 'User-Agent';

// Button
$_['button_patch_htaccess']        = 'Εφαρμογή αλλαγών στο .htaccess';
$_['button_validate_robotstxt']    = 'Επικύρωση Κανόνων Robots.txt';

// Help
$_['help_copy']                    = 'Αντιγραφή URL';
$_['help_open']                    = 'Άνοιγμα URL';
$_['help_product_images']          = 'Η εξαγωγή εικόνων προϊόντων μπορεί να αυξήσει τον αρχικό χρόνο επεξεργασίας (μόνο όταν οι εικόνες υποβάλλονται σε επεξεργασία για πρώτη φορά) και το μέγεθος του αρχείου XML του χάρτη ιστοτόπου θα είναι μεγαλύτερο ως αποτέλεσμα.';
$_['help_htaccess_mod']            = 'Η SEO-φιλική διεύθυνση URL ροής δεδομένων απαιτεί τροποποίηση του αρχείου .htaccess. Μπορείτε να προσθέσετε χειροκίνητα τον απαιτούμενο κώδικα αντιγράφοντας και επικολλώντας τον στο αρχείο .htaccess ή απλώς κάνοντας κλικ στο πορτοκαλί κουμπί "Εφαρμογή αλλαγών στο .htaccess" για να εφαρμοστούν αυτόματα οι αλλαγές.';

// Error
$_['error_permission']             = 'Προειδοποίηση: Δεν έχετε άδεια να τροποποιήσετε τη ροή του Χάρτη ιστοτόπου Google!';
$_['error_htaccess_update']        = 'Προειδοποίηση: Υπήρξε σφάλμα κατά την ενημέρωση του αρχείου .htaccess. Ελέγξτε τις άδειες του αρχείου και προσπαθήστε ξανά.';
$_['error_store_id']               = 'Προειδοποίηση: Η φόρμα δεν περιέχει store_id!';
$_['error_max_product_images_min'] = 'Η τιμή για τον μέγιστο αριθμό εικόνων προϊόντων δεν μπορεί να είναι μικρότερη από το μηδέν.';
